{"review":"Latest update seems to have removed the group option for Smart Home when setting up a routine.  Love the new “Alexa says” option. Much better than “okay”.","author":"Dan in KC","review_source":"iTunes","rating":5,"title":"Groups missing in Routines","product_name":"Amazon Alexa","reviewed_date":"2018-01-01T22:06:14.000Z"}
{"review":"First the good I love the shopping list and how it updates works great for a working family for some one to add something while your shopping BUT the rest of the app is junk my biggest issue is the smart home part. It is slow and unreliable controlling devices not directly paired to the echo plus hub. When we are away from home it controls devices about half the time as well as the routines only work about half the time even on my home wifi. Even though I can Open the Hue app or the Wink app and make everything work like it should on the first try but going through the Alexa app it's a 50-50 shot","author":"Jlom 09","review_source":"iTunes","rating":1,"title":"Alexa app NEEDs WORK","product_name":"Amazon Alexa","reviewed_date":"2018-01-02T03:45:13.000Z"}
{"review":"There needs to be a way to manually tell Alexa I want to play on my home Echo group.\n\nI don’t know why Amazon can’t seem to figure out how to create a “cast” option from the Amazon Music app, or embed the Amazon music app inside of the Alexa app.  I know there is a half integration where I can specify the artist, but I need the fidelity level to get playlists, artist, albums, genres, things like that.\n\nAlexa can’t seem to find some albums or songs when I ask her to play it on a group, but if I ask her the exact same question without the group command she finds it just fine.  Annoying.","author":"Bentley_J","review_source":"iTunes","rating":2,"title":"Needs direct play option","product_name":"Amazon Alexa","reviewed_date":"2018-01-02T06:19:44.000Z"}
{"review":"I really like the routines options because it allows for multiple actions with a single command. But there are very minimum actions that can be used in routines. One that would make a reasonable feature into an awesome one would be to open and play a preset audible book and if it allowed for a time limit that would be icing on the cake.","author":"Pro682","review_source":"iTunes","rating":3,"title":"Cool new feature some missing new features","product_name":"Amazon Alexa","reviewed_date":"2018-01-02T06:55:35.000Z"}
{"review":"Alexa app can no longer control my smartplugs. They still work correctly directly through Smart Life app so I know there is nothing wrong with the outlets or their connection to WiFi.","author":"Rubberchicken12","review_source":"iTunes","rating":4,"title":"Version 880 broke Smart Life integration","product_name":"Amazon Alexa","reviewed_date":"2018-01-02T09:10:01.000Z"}
{"review":"I had all devices working and now none work with latest update!!! I use smart life app to set up and nothing works. Alexa keeps saying OK but cannot turn any devices anymore. PLEASE FIX IMMEDIATELY.","author":"Mike14120","review_source":"iTunes","rating":3,"title":"Everything is now broken!!","product_name":"Amazon Alexa","reviewed_date":"2018-01-02T09:19:55.000Z"}
{"review":"Just updated my app and now I can’t even open it. I get an error message and then the login screen, but when I click login nothing happens. So... completely useless.","author":"gidget2282","review_source":"iTunes","rating":3,"title":"App stopped working","product_name":"Amazon Alexa","reviewed_date":"2018-01-02T12:48:01.000Z"}
{"review":"Meh","author":"Formerbarista","review_source":"iTunes","rating":3,"title":"Not updated for iPhone X","product_name":"Amazon Alexa","reviewed_date":"2018-01-02T15:10:27.000Z"}
{"review":"If you can’t wait to hear: “Alexa cannot connect to your WiFi Network” 35 times, then this is the product for you!!","author":"Hell yes it's loaded.","review_source":"iTunes","rating":5,"title":"Does not connect. Get the Google product.","product_name":"Amazon Alexa","reviewed_date":"2018-01-02T16:52:14.000Z"}
{"review":"This app has always been bad when trying to set up Echo. However, I've always been able to get it to connect to the network eventually. Not today, apparently. I've literally spent hours. Between closing and restarting the app, resetting the device with a paper clip and just waiting for the process to fail, I've gotten nowhere. Not sure what kind of network is needed, maybe one with no passwords? The app interface is just bad UX, plain and simple. Hit a back button and end up on the Home screen. Try to join a pw protected network and wait for the connection to fail so you can finally see the password prompt. Complete setup and you are stuck on a video tutorial screen. Once you get the thing working, the device is great (not the app). Just pray you don't ever need to set up again. With all of Bezos' billions, you'd think they could hire some real developers and UX designers.","author":"uncleridiculous725216","review_source":"iTunes","rating":3,"title":"Can't connect","product_name":"Amazon Alexa","reviewed_date":"2018-01-02T19:01:41.000Z"}
{"review":"This app is unusable after the update, iPhone X issue?","author":"S.Lebowski","review_source":"iTunes","rating":4,"title":"Stuck at Permissions View","product_name":"Amazon Alexa","reviewed_date":"2018-01-02T19:20:18.000Z"}
{"review":"Time to update app for iPhone X resolution.","author":"c2k4rx8","review_source":"iTunes","rating":2,"title":"iPhone X","product_name":"Amazon Alexa","reviewed_date":"2018-01-02T19:22:28.000Z"}
{"review":"Is not working","author":"Sfinxme","review_source":"iTunes","rating":3,"title":"A crap","product_name":"Amazon Alexa","reviewed_date":"2018-01-02T22:32:59.000Z"}
{"review":"I bought 3 echo dots. And they changed the ability that be able to stream on more than 1 device. Feel like I got scammed.","author":"Last biking","review_source":"iTunes","rating":3,"title":"Scam","product_name":"Amazon Alexa","reviewed_date":"2018-01-02T23:17:19.000Z"}
{"review":"Far everything Alexa does right, it makes the shortcomings even more glaring. \n\nEspecially when it comes to smart home features. When it comes to automation, I don’t want everything to happen the second I say a command. For instance, if I say “I’m leaving the house”. I want Alexa to wait until I’m out of the house before it locks the door. Easily fixed by adding a “wait 30 seconds” ability. \n\nAlso frustrated that the only info I can get from a flash briefing are skills that are specifically made for flash briefing. Any question that I can ask Alexa, skill or not, should be able to pipe the answer to the flash briefing.","author":"Scott_H_Wilder","review_source":"iTunes","rating":3,"title":"Great app. Could be better","product_name":"Amazon Alexa","reviewed_date":"2018-01-03T00:42:41.000Z"}
{"review":"1 star until I can use the settings tab.\n\nI can’t connect my dot from an iPhone and it’s gotta get sorted out or we’re gonna take it back.","author":"MAndersonComedy","review_source":"iTunes","rating":3,"title":"Buggy, can’t connect","product_name":"Amazon Alexa","reviewed_date":"2018-01-03T01:12:35.000Z"}
{"review":"Ever since this app update my echo no longer connects to the internet.","author":"ssadfsdf","review_source":"iTunes","rating":3,"title":"Echo can’t connect to internet","product_name":"Amazon Alexa","reviewed_date":"2018-01-03T01:13:58.000Z"}
{"review":"I love my Alexa but the app is so fricken slow and I cannot manage anything without it taking forever to load.","author":"Moms-account","review_source":"iTunes","rating":3,"title":"Slow","product_name":"Amazon Alexa","reviewed_date":"2018-01-03T02:08:17.000Z"}
{"review":"Replaced it with same echo 2nd gen and it still only points towards its power cord in the middle of a dead quiet room no matter where I stand. After I spent 2 hours setting up my 16 different hue lights the new one didn’t port that info and I don’t feel like doing it again. UPS return label peeling off the printer right now.","author":"Allenheights","review_source":"iTunes","rating":3,"title":"LED points in one direction only. Can’t hear me.","product_name":"Amazon Alexa","reviewed_date":"2018-01-03T02:14:59.000Z"}
{"review":"Today when I get back from work, I can NOT turn lights on through Alexa!?!? \n\nWhat’s wrong with this latest update? All my TP-Link smart plugs (which was purchased as a bundle with Echo Dot) does not work with Alexa anymore!!!!\n\nThe only way I can turn my lights on are through TP-Link Kasa app.....\n\nReally disappointed to this stupid update by Amazon. Especially when they FALSELY stated that “You can now add devices easily to smart homes” what a JOKE...","author":"macakacheck","review_source":"iTunes","rating":3,"title":"Latest update turns SMART home to DUMB home","product_name":"Amazon Alexa","reviewed_date":"2018-01-03T02:25:54.000Z"}
{"review":"Out of the many issues I can touch on, one really bugs me. A L A R M S! As soon as I hit the alarm and reminder button, and then proceed to change the sound and time of an alarm, it freezes. I can’t use it at all in any way! After restarting the app and trying everything and all, nothing. I’m using an iPhone 6S mind you.","author":"Eatingsawdust","review_source":"iTunes","rating":3,"title":"I’m trying to like it, but that is not happening","product_name":"Amazon Alexa","reviewed_date":"2018-01-03T02:54:39.000Z"}
{"review":"It was not easy to set up but I finally did.  I loved the app since I got it because of the routines that could be used with Echo Dot however it is now having problems.  One of my devices which is working perfectly under Kasa is no longer responsive under Alexa app which means the echo is not understanding it.  All other devices are fine except this one... it seems to be temperamental.","author":"Mazenhelkhatib","review_source":"iTunes","rating":2,"title":"Temper-mental","product_name":"Amazon Alexa","reviewed_date":"2018-01-03T04:04:37.000Z"}
{"review":"Amazon really needs to scrap this app and start over. Very clunky and not user friendly. Just doesn’t feel right and definitely not up to Amazon standards.","author":"craig1021","review_source":"iTunes","rating":2,"title":"Amazon is better than this app","product_name":"Amazon Alexa","reviewed_date":"2018-01-03T04:50:52.000Z"}
{"review":"I bought this echo dot for christmas gift, but it constantly makes problems and not connected very well. :( feels awful","author":"모모몽비","review_source":"iTunes","rating":3,"title":"An unstable device","product_name":"Amazon Alexa","reviewed_date":"2018-01-03T11:05:02.000Z"}
{"review":"I think some of the skill integration could be better. For example, I use the trackr app to find my phone. When I ask Alexa to find my phone, she’ll say something like “there are several skills I can find your phone with...” and goes on to explain that that trackr app can find my phone. I already know this because the skill is downloaded and the app is linked. Then she’ll proceed to ask me what I want to do. I’ll again say “find my phone” and then she’ll make it ring. It just seems like more dialogue hoops to jump through than necessary. I don’t think anything compares to Alexa right now, but it’d be nice to have the feeling that it “just works”.\nAlso, optimization for iPhone X should have been implemented already, Amazon is late to the game with that. I’ll bump it up another star once they do that.","author":"Calvillar","review_source":"iTunes","rating":3,"title":"Needs some work.","product_name":"Amazon Alexa","reviewed_date":"2018-01-03T14:52:48.000Z"}
{"review":"Very difficult erasing history..   too many glitches for what is supposed to be a good app","author":"hypothysis","review_source":"iTunes","rating":3,"title":"Me","product_name":"Amazon Alexa","reviewed_date":"2018-01-03T15:16:35.000Z"}
